Step 1 - Data Engineering
The climate data for Hawaii is provided through two CSV files. Start by using Python and Pandas to inspect the content of these files and clean the data.

Create a Jupyter Notebook file called data_engineering.ipynb and use this to complete all of your Data Engineering tasks.

Use Pandas to read in the measurement and station CSV files as DataFrames.

Inspect the data for NaNs and missing values. You must decide what to do with this data.

Save your cleaned CSV files with the prefix clean_.

In [1]:
# Dependencies
import pandas as pd
import numpy as np
import os

In [2]:
# Path of the CSV file
csvfile = "Resources\hawaii_measurements.csv"

csvfile2 = "Resources\hawaii_stations.csv"

In [3]:
# Read CSV file into a pandas DataFrame
measurements_df = pd.read_csv(csvfile, dtype=object)

In [4]:
# Preview DataFrame
# Note that some rows are missing gender
measurements_df.head()

       station        date  prcp tobs
0  USC00519397  2010-01-01  0.08   65
1  USC00519397  2010-01-02     0   63
2  USC00519397  2010-01-03     0   74
3  USC00519397  2010-01-04     0   76
4  USC00519397  2010-01-06   NaN   73

In [ ]:
# Use `dropna` to drop any rows where there is missing data
# Notice that index has not been reset and contains a gap (0,2,5,6,7)
#measurements_df = measurements_df.dropna(axis=0)
#measurements_df.head()

In [5]:
measurements_df['prcp']=measurements_df['prcp'].fillna(0)

In [6]:
measurements_df.head()

       station        date  prcp tobs
0  USC00519397  2010-01-01  0.08   65
1  USC00519397  2010-01-02     0   63
2  USC00519397  2010-01-03     0   74
3  USC00519397  2010-01-04     0   76
4  USC00519397  2010-01-06     0   73

In [7]:
measurements_df.describe()

            station        date   prcp   tobs
count         19550       19550  19550  19550
unique            9        2792    343     35
top     USC00519281  2011-05-02      0     74
freq           2772           9   8185   1752

In [8]:
# Stations
# Read CSV file into a pandas DataFrame
stations_df = pd.read_csv(csvfile2, dtype=object)

In [9]:
# Preview DataFrame
# Note that some rows are missing gender
stations_df.head()

,station,name,latitude,longitude,elevation
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3
1,USC00513117,"KANEOHE 838.1, HI US",21.4234,-157.8015,14.6
2,USC00514830,"KUALOA RANCH HEADQUARTERS 886.9, HI US",21.5213,-157.8374,7
3,USC00517948,"PEARL CITY, HI US",21.3934,-157.9751,11.9
4,USC00518838,"UPPER WAHIAWA 874.3, HI US",21.4992,-158.0111,306.6

In [10]:
stations_df.describe()

,station,name,latitude,longitude,elevation
count,9,9,9,9,9
unique,9,9,9,9,9
top,USC00511918,"HONOLULU OBSERVATORY 702.2, HI US",21.3152,-157.9751,306.6
freq,1,1,1,1,1

In [11]:
print(stations_df)

       station                                    name  latitude   longitude  \
0  USC00519397                    WAIKIKI 717.2, HI US   21.2716   -157.8168
1  USC00513117                    KANEOHE 838.1, HI US   21.4234   -157.8015
2  USC00514830  KUALOA RANCH HEADQUARTERS 886.9, HI US   21.5213   -157.8374
3  USC00517948                       PEARL CITY, HI US   21.3934   -157.9751
4  USC00518838              UPPER WAHIAWA 874.3, HI US   21.4992   -158.0111
5  USC00519523      WAIMANALO EXPERIMENTAL FARM, HI US  21.33556  -157.71139
6  USC00519281                     WAIHEE 837.5, HI US  21.45167  -157.84889
7  USC00511918       HONOLULU OBSERVATORY 702.2, HI US   21.3152   -157.9992
8  USC00516128            MANOA LYON ARBO 785.2, HI US   21.3331   -157.8025

  elevation
0         3
1      14.6
2         7
3      11.9
4     306.6
5      19.5
6      32.9
7       0.9
8     152.4

In [13]:
# Save the cleaned data to a file called `customers_cleaned.csv`
new_csv = "clean_hawaii_measurements.csv"
measurements_df.to_csv(new_csv, index=False)
new_csv2 = "clean_hawaii_stations.csv"
stations_df.to_csv(new_csv2, index=False)